added content for documentation
